Revit 2027 API
MassInstanceUtils.GetMassLevelIds Method
 Get the ElementIds of the Levels associated with a mass instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetMassLevelIds(
	Document document,
	ElementId massInstanceId
)
Public Shared Function GetMassLevelIds (
	document As Document,
	massInstanceId As ElementId
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetMassLevelIds(
	Document^ document,
	ElementId^ massInstanceId
)
static member GetMassLevelIds :
        document : Document *
        massInstanceId : ElementId -> IList<ElementId>
Parameters
document Document
 The Document.
massInstanceId ElementId
 The ElementId of the mass instance.
Return Value
IList<ElementId>
 The ElementIds of the Levels
Exceptions
Exception | Condition
ArgumentException |  The ElementId massInstanceId is not a mass instance.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MassInstanceUtils Class
Autodesk.Revit.DB Namespace